// titleをkeyに使っているので一意である必要があることに注意
export const eventItems = [
  {
    date: "2018-04",
    title: "東京電機大学入学",
    text: "機械工学科として、力学を勉強",
  },
  {
    date: "2020-09",
    title: "C言語学習",
    text: "大学の授業で初めてプログラミングに触れて、プログラムが理想通り動いた時の達成感を得る",
  },
  {
    date: "2021-06",
    title: "A社IT企業への就職が決定",
    text:"入社後の業務に備えて、javaを学び始める",
  },
  {
    date: "2022-03",
    title: "東京電機大学卒業",
    text: "卒業論文に悩まされたが、何とか卒業！！",
  },
  {
    date: "2022-04",
    title: "A社IT企業へ入社",
    text: "研修が終わると、介護保険システムの導入、運用保守案件に配属",
  },
  {
    date: "2024-06",
    title: "基本情報処理試験に合格",
  },
  {
    date: "2024-11",
    title: "B社IT企業へ転職",
    text: "海外送金システムのマネーロンダリング審査業務を行う",
  },
  {
    date: "2025-04",
    title: "応用情報処理試験に合格",
  },
  {
    date: "2025-05",
    title: "スキルアップと収入アップのため、副業開始",
    text: "react,javaの利用経験を活かして、ポートフォリオやショッピングサイトを作成中",
  },
];
